<!-- dflook/terraform-github-actions {"workspace":"fix-no-state","backend_type":"remote","plan_modifier":"9ebdcefa28ba58bd0b2d6fc795d575dba5541517ae08f41ba0945779d06b671e","backend":"a70ca46dc7b35eb4997f869c859d0a5a8614101c46a3f7ebc2a4c0d9f3b404ba","plan_job_ref":"Job Test plan target and replace #354 at https://github.com/dflook/terraform-github-actions/actions/runs/5662408215","plan_hash":"8b59659eb8910a501e8debe28287d0f49cffdf6d7410fd70517cb10688b1c106","plan_text_format":"text","version":"99.0.0"} -->
Terraform plan in __tests/workflows/test-target-replace__ in the __fix-no-state__ workspace
Targeting resources: `random_string.foreach["hello"]`
Replacing resources: `random_string.foreach["hello"]`, `random_string.count[0]`
With variables: `length = 10`
<details>
<summary>Plan: 1 to add, 0 to change, 1 to destroy. Changes to Outputs.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # random_string.foreach["hello"] will be replaced, as requested
-/+ resource "random_string" "foreach" {
      ~ id          = "**********" -> (known after apply)
      ~ result      = "**********" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.

Changes to Outputs:
  ~ foreach = "tkIU3DTjP1" -> (known after apply)
╷
│ Warning: Resource targeting is in effect
│ 
│ You are creating a plan with the -target option, which means that the
│ result of this plan may not represent all of the changes requested by the
│ current configuration.
│ 		
│ The -target option is not for routine use, and is provided only for
│ exceptional situations such as recovering from errors or mistakes, or when
│ Terraform specifically suggests to use it as part of an error message.
╵
```
</details>

:memo: Plan generated in [Test plan target and replace #354](https://github.com/dflook/terraform-github-actions/actions/runs/5662408215)